import random

answers = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определенно да", "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"]

name = input("Как тебя зовут?")
print(f"Привет, {name}! Я магический шар, и я знаю ответ на любой твой вопрос")

while True:
    input("Задай вопрос: ")
    print(random.choice(answers))
    if input("Еще вопрос? (да\нет): ") != "да":
        print("Возвращайся, если возникнут вопросы!")
        break
